Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/СводыЗнанийСУЗ/Forms/ФормаСтатистика/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьДиаграмму()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Дата,
		|	РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВремяПрохожденияВСекундах
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|%1%2%3%4%5%6";

		
	Подстановка1 = "";
	Подстановка2 = "";
	Подстановка3 = "";
	Подстановка4 = "";
	Подстановка5 = "";
	Подстановка6 = "";
		
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Подстановка1 = " ГДЕ ";
		Подстановка2 = " РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь И";
		Запрос.УстановитьПараметр("Пользователь", Параметры.Пользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Задание) Тогда
		Подстановка1 = " ГДЕ ";
		Подстановка3 = " РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание И";
		Запрос.УстановитьПараметр("Задание", Параметры.Задание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПрохождениеОбучения) Тогда
		Подстановка1 = " ГДЕ ";
		Подстановка4 = " РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения И";
		Запрос.УстановитьПараметр("ПрохождениеОбучения", Параметры.ПрохождениеОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		Подстановка1 = " ГДЕ ";
		Подстановка5 = " РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс И";
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", Параметры.ЭлектронныйРесурс);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодДиаграммы) Тогда
		Подстановка1 = " ГДЕ ";
		Подстановка6 = " РегистрСведенийПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период МЕЖДУ &НачалоПериода И &КонецПериода И";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодДиаграммы.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода", ПериодДиаграммы.ДатаОкончания);
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, Подстановка1, Подстановка2, Подстановка3, Подстановка4, Подстановка5, Подстановка6);
	
	Если ЗначениеЗаполнено(Подстановка1) Тогда
		Запрос.Текст = Сред(Запрос.Текст, 1, СтрДлина(Запрос.Текст) - 1); // Убираем последнюю "И"
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	ТаблицаДанныхАктивности = Результат.Выгрузить();

	ТаблицаДанныхАктивности.Колонки.Добавить("КоличествоПопыток");
	
	Для каждого Строка Из ТаблицаДанныхАктивности Цикл
	
		Строка.КоличествоПопыток = 1;
		
		Если ШагДиаграммы = "Неделя" Тогда
			Строка.Дата = НачалоНедели(Строка.Дата);	
		ИначеЕсли ШагДиаграммы = "Месяц" Тогда
			Строка.Дата = НачалоМесяца(Строка.Дата);	
		ИначеЕсли ШагДиаграммы = "Год" Тогда
			Строка.Дата = НачалоГода(Строка.Дата);	
		ИначеЕсли ШагДиаграммы = "Квартал" Тогда
			Строка.Дата = НачалоКвартала(Строка.Дата);	
		Иначе
			Строка.Дата = НачалоДня(Строка.Дата);
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаДанныхАктивности.Свернуть("Дата", "КоличествоПопыток, ВремяПрохожденияВСекундах");
	
	ДиаграммаАктивности.Обновление = Ложь;
	ДиаграммаАктивности.Очистить();

	СерияДиаграммы = ДиаграммаАктивности.УстановитьСерию("Количество попыток");

	Если ЗначениеЗаполнено(ПериодДиаграммы.ДатаНачала) Тогда
		
		ТекущаяДата = ПериодДиаграммы.ДатаНачала;
		
	Иначе	
		
		Если ТаблицаДанныхАктивности.Количество() > 0 Тогда
			ТекущаяДата = ТаблицаДанныхАктивности[0].Дата;
		Иначе
			ТекущаяДата = Дата("00010101");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодДиаграммы.ДатаОкончания) Тогда
		ПоследняяДата = ПериодДиаграммы.ДатаОкончания;
	Иначе	
		Если ТаблицаДанныхАктивности.Количество() > 0 Тогда
			ПоследняяДата = ТаблицаДанныхАктивности[ТаблицаДанныхАктивности.Количество()-1].Дата;
		Иначе
			ПоследняяДата = Дата("00010101");
		КонецЕсли;
		
	КонецЕсли;
	
	Пока ТекущаяДата <= ПоследняяДата Цикл
		
		Если ШагДиаграммы = "Неделя" ИЛИ ШагДиаграммы = "Квартал" Тогда
			ТочкаДиаграммы = ДиаграммаАктивности.УстановитьТочку(Формат(ТекущаяДата, "ДЛФ=D") + " - " + Формат(КонецНедели(ТекущаяДата), "ДЛФ=D"));
		ИначеЕсли ШагДиаграммы = "Месяц" Тогда
			ТочкаДиаграммы = ДиаграммаАктивности.УстановитьТочку(Формат(ТекущаяДата, "ДФ=MM.yyyy"));
		ИначеЕсли ШагДиаграммы = "Год" Тогда
			ТочкаДиаграммы = ДиаграммаАктивности.УстановитьТочку(Формат(ТекущаяДата, "ДФ=yyyy"));
		Иначе
			ТочкаДиаграммы = ДиаграммаАктивности.УстановитьТочку(Формат(ТекущаяДата, "ДЛФ=D"));
		КонецЕсли;			
		
		Строка = ТаблицаДанныхАктивности.Найти(ТекущаяДата, "Дата");
		
		Если Строка = Неопределено Тогда
			
			ДиаграммаАктивности.УстановитьЗначение(ТочкаДиаграммы, СерияДиаграммы, 0);
			
		Иначе				
			
			Если ЗначениеДиаграммы = "ВремяВСекундах" Тогда
				ДиаграммаАктивности.УстановитьЗначение(ТочкаДиаграммы, СерияДиаграммы, Строка.ВремяПрохожденияВСекундах);	
			ИначеЕсли ЗначениеДиаграммы = "ВремяВМинутах" Тогда
				ДиаграммаАктивности.УстановитьЗначение(ТочкаДиаграммы, СерияДиаграммы, Окр(Строка.ВремяПрохожденияВСекундах / 60, 2));	
			ИначеЕсли ЗначениеДиаграммы = "ВремяВЧасах" Тогда
				ДиаграммаАктивности.УстановитьЗначение(ТочкаДиаграммы, СерияДиаграммы, Окр(Строка.ВремяПрохожденияВСекундах / 60 / 60, 2));	
			Иначе
				ДиаграммаАктивности.УстановитьЗначение(ТочкаДиаграммы, СерияДиаграммы, Строка.КоличествоПопыток);	
			КонецЕсли;				
			
		КонецЕсли;
		
		// Переходим к следующей дате
			
		Если ШагДиаграммы = "Неделя" Тогда
			ТекущаяДата = НачалоНедели(ТекущаяДата + (60*60*24*7));
		ИначеЕсли ШагДиаграммы = "Месяц" Тогда
			ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 1);
		ИначеЕсли ШагДиаграммы = "Год" Тогда
			ТекущаяДата = НачалоГода(ТекущаяДата + (60*60*24*365));
		ИначеЕсли ШагДиаграммы = "Квартал" Тогда
			ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 3);
		Иначе
			ТекущаяДата = НачалоДня(ТекущаяДата + (60*60*24));
		КонецЕсли;			
		
	КонецЦикла;		
		
	ДиаграммаАктивности.ОтображатьЛегенду = Ложь;
	
	Если ЗначениеЗаполнено(ПредставлениеДиаграммы) Тогда
		ДиаграммаАктивности.ТипДиаграммы = ТипДиаграммы[ПредставлениеДиаграммы];
	Иначе
		ДиаграммаАктивности.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	КонецЕсли;
	
	ДиаграммаАктивности.Обновление = Истина;
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры
	
	Если НЕ ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЭлектронныйРесурс, "ЭтоГруппа") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Электронный ресурс не выбран. Действие отменено'"),,,,Отказ);
	КонецЕсли;
	
	// Переменные
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек = Неопределено Тогда
		
		ЗначениеДиаграммы = "Попытки";
		ПредставлениеДиаграммы = "Гистограмма";
		ШагДиаграммы = "Месяц";
		
	Иначе
		
		Для каждого ЗначениеНастройки Из ДанныеНастроек Цикл
			ЭтотОбъект[ЗначениеНастройки.Ключ] = ЗначениеНастройки.Значение; 
		КонецЦикла;
		
	КонецЕсли;
		
	ЕстьПравоПросмотраСессий = Ложь;
	ЭлектронныеРесурсыПереопределяемый.ПриОпределенииПраваПросмотраПрохожденийДругихПользователей(ЕстьПравоПросмотраСессий);
	
	// Отборы
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Активность.Отбор, "Пользователь", Параметры.Пользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Задание) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Активность.Отбор, "Задание", Параметры.Задание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПрохождениеОбучения) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Активность.Отбор, "ПрохождениеОбучения", Параметры.ПрохождениеОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Активность.Отбор, "ЭлектронныйРесурс", Параметры.ЭлектронныйРесурс);
	КонецЕсли;
	
	// Заголовок
	
	Заголовок = НСтр("ru = 'Статистика: '");
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Заголовок = Заголовок + Параметры.Пользователь + ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Задание) Тогда
		Заголовок = Заголовок + Параметры.Задание + ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		Заголовок = Заголовок + Параметры.ЭлектронныйРесурс + ", ";
	КонецЕсли;
	
	Заголовок = Сред(Заголовок, 1, СтрДлина(Заголовок) - 2);
	
	// Видимость элементов
	
	Элементы.АктивностьПользователь.Видимость        = НЕ ЗначениеЗаполнено(Параметры.Пользователь);
	Элементы.АктивностьЭлектронныйРесурс.Видимость   = НЕ ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс);
	
	Если Элементы.Найти("АктивностьПрохождениеОбучения") <> Неопределено Тогда 
		Элементы.АктивностьПрохождениеОбучения.Видимость = НЕ ЗначениеЗаполнено(Параметры.ПрохождениеОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Задание)
		ИЛИ Параметры.МероприятиеСОднимЗаданием Тогда
		
		Элементы.АктивностьЗадание.Видимость = Ложь;
		
	КонецЕсли;
	
	// Формируем статистику
	
	СформироватьДиаграмму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПрохождениеОбучения" Тогда
		Элементы.Активность.Обновить();
		СформироватьДиаграмму();
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПериодДиаграммыПриИзменении(Элемент)
	СформироватьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ШагДиаграммыПриИзменении(Элемент)
	СформироватьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеДиаграммыПриИзменении(Элемент)
	СформироватьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ТипДиаграммыПриИзменении(Элемент)
	СформироватьДиаграмму();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Активность

&НаКлиенте
Процедура АктивностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено
		ИЛИ НЕ ЕстьПравоПросмотраСессий Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(Элемент.ТекущиеДанные.ЭлектронныйРесурс,
										 Элемент.ТекущиеДанные.СсылкаНаОбъектСУЗ,
										 Истина,
										 Элемент.ТекущиеДанные.ЭлементСодержанияСсылка,
										 Элемент.ТекущиеДанные.ПрохождениеОбучения,
										 Элемент.ТекущиеДанные.Задание);
		
	
КонецПроцедуры
